exacttarget/exacttarget-connector/exacttarget-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/exacttarget/esb_listDataExtensionObjects_optional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.exacttarget"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header></soapenv:Header>
   <soapenv:Body>
      <urn:accessToken>%s(accessToken)</urn:accessToken>
      <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
      <urn:properties>%s(dataExtField1),%s(dataExtField2)</urn:properties>
      <urn:customerKey>%s(dataExtCustomerKey)</urn:customerKey>
      <urn:dataExtensionFilter>
         <Filter>
            <Property>%s(dataExtField1)</Property>
            <SimpleOperator>equals</SimpleOperator>
            <Value>%s(fieldOneVlaue)</Value>
         </Filter>
      </urn:dataExtensionFilter>
      <urn:method>listDataExtensionObjects</urn:method>
   </soapenv:Body>
</soapenv:Envelope>